socialNetwork/results/benchmark1.5b-replica-scale-09-05-26_195041/scale-16x/st5-AttUpd/1200.txt
Running 2m test @ http://155.98.38.240:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 25.025ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 24.166ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 24.294ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 24.669ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 24.136ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 24.411ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 24.531ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 24.449ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 24.130ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 24.426ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 24.725ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 24.293ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 24.194ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 23.980ms, rate sampling interval: 66ms
  Thread calibration: mean lat.: 24.082ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 24.622ms, rate sampling interval: 71ms

-----------------------------------------------------------------------
Test Results @ http://155.98.38.240:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    24.48ms    7.84ms  54.43ms   82.55%
    Req/Sec    75.19     32.28   157.00     74.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.66ms
 75.000%   25.76ms
 90.000%   34.59ms
 99.000%   54.43ms
 99.900%   73.66ms
 99.990%   93.63ms
 99.999%  108.67ms
100.000%  113.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      11.399     0.000000            1         1.00
      17.919     0.100000        13240         1.11
      19.327     0.200000        26630         1.25
      20.399     0.300000        39752         1.43
      21.615     0.400000        52960         1.67
      22.655     0.500000        66206         2.00
      23.135     0.550000        72896         2.22
      23.615     0.600000        79485         2.50
      24.143     0.650000        86009         2.86
      24.815     0.700000        92674         3.33
      25.759     0.750000        99254         4.00
      26.431     0.775000       102518         4.44
      27.279     0.800000       105812         5.00
      28.399     0.825000       109137         5.71
      29.935     0.850000       112431         6.67
      31.967     0.875000       115747         8.00
      33.215     0.887500       117423         8.89
      34.591     0.900000       119054        10.00
      36.063     0.912500       120712        11.43
      37.599     0.925000       122377        13.33
      39.263     0.937500       124006        16.00
      40.191     0.943750       124849        17.78
      41.119     0.950000       125659        20.00
      42.143     0.956250       126499        22.86
      43.263     0.962500       127311        26.67
      44.607     0.968750       128146        32.00
      45.375     0.971875       128562        35.56
      46.271     0.975000       128967        40.00
      47.359     0.978125       129378        45.71
      48.607     0.981250       129789        53.33
      50.367     0.984375       130208        64.00
      51.295     0.985938       130408        71.11
      52.383     0.987500       130612        80.00
      53.535     0.989062       130819        91.43
      55.039     0.990625       131027       106.67
      56.607     0.992188       131231       128.00
      57.503     0.992969       131337       142.22
      58.687     0.993750       131442       160.00
      59.967     0.994531       131542       182.86
      61.567     0.995313       131647       213.33
      63.039     0.996094       131748       256.00
      63.935     0.996484       131801       284.44
      64.959     0.996875       131852       320.00
      65.919     0.997266       131904       365.71
      67.199     0.997656       131955       426.67
      68.799     0.998047       132006       512.00
      69.887     0.998242       132033       568.89
      70.783     0.998437       132059       640.00
      71.679     0.998633       132084       731.43
      72.575     0.998828       132112       853.33
      73.855     0.999023       132135      1024.00
      74.943     0.999121       132149      1137.78
      75.839     0.999219       132161      1280.00
      77.247     0.999316       132175      1462.86
      78.207     0.999414       132187      1706.67
      79.935     0.999512       132200      2048.00
      80.703     0.999561       132206      2275.56
      82.303     0.999609       132214      2560.00
      82.687     0.999658       132219      2925.71
      83.455     0.999707       132226      3413.33
      84.991     0.999756       132233      4096.00
      85.695     0.999780       132235      4551.11
      86.975     0.999805       132240      5120.00
      88.383     0.999829       132242      5851.43
      90.047     0.999854       132245      6826.67
      92.223     0.999878       132248      8192.00
      93.439     0.999890       132250      9102.22
      93.951     0.999902       132252     10240.00
      94.783     0.999915       132253     11702.86
      96.191     0.999927       132255     13653.33
      96.639     0.999939       132256     16384.00
      97.087     0.999945       132257     18204.44
      99.519     0.999951       132258     20480.00
     102.335     0.999957       132259     23405.71
     102.911     0.999963       132261     27306.67
     102.911     0.999969       132261     32768.00
     102.911     0.999973       132261     36408.89
     102.911     0.999976       132261     40960.00
     107.263     0.999979       132262     46811.43
     107.263     0.999982       132262     54613.33
     107.263     0.999985       132262     65536.00
     108.671     0.999986       132263     72817.78
     108.671     0.999988       132263     81920.00
     108.671     0.999989       132263     93622.86
     108.671     0.999991       132263    109226.67
     108.671     0.999992       132263    131072.00
     113.023     0.999993       132264    145635.56
     113.023     1.000000       132264          inf
#[Mean    =       24.481, StdDeviation   =        7.840]
#[Max     =      112.960, Total count    =       132264]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  144154 requests in 2.00m, 1.79GB read
  Non-2xx or 3xx responses: 1
Requests/sec:   1201.36  
Transfer/sec:     15.31MB